<template>
  <div class="background">
    <v-row
      class="mx-0 mb-1"
      style="margin-top: 80px"
      v-if="
        $vuetify.breakpoint.name == 'xs' || $vuetify.breakpoint.name == 'sm'
      "
    >
      <v-col cols="4" offset="1" class="d-flex justify-center align-center"
        ><v-btn
          @click="
            $router.push({
              name: 'Service',
              params: {
                id: currentId - 1,
              },
            })
          "
          large
          v-if="currentId > 1"
          ><v-icon style="font-size: 40px">mdi-arrow-left</v-icon></v-btn
        ></v-col
      >
      <v-col cols="2"></v-col>
      <v-col class="d-flex justify-center align-center" cols="4"
        ><v-btn
          @click="
            $router.push({
              name: 'Service',
              params: {
                id: currentId + 1,
              },
            })
          "
          large
          v-if="currentId < 9"
          ><v-icon style="font-size: 40px">mdi-arrow-right</v-icon></v-btn
        ></v-col
      >
    </v-row>
    <v-row
      :style="
        (mobile.marg, $vuetify.breakpoint.mobile ? '' : 'min-height:100vh')
      "
      :class="mobile.center"
      class="ma-0 no-gutters"
      style="min-height: 70vh"
    >
      <v-col cols="12" offset="0" offset-sm="0" md="4" offset-md="1">
        <div class="white pa-2">
          <v-img min-width="300" :src="services[currentId - 1].image"></v-img>
        </div>
      </v-col>
      <v-col
        cols="12"
        md="6"
        class="pa-3 mx-md-2"
        :class="[
          mobile.back,
          showText && !$vuetify.breakpoint.mobile ? 'inforamtionContainer' : '',
        ]"
      >
        <v-container>
          <div class="text-h5 text-sm-h3 text-md-h3 orange-underline mb-10">
            <span class="ubuntu">{{ services[currentId - 1].title }}</span>
          </div>
          <div class="text-h5 text-sm-h4 text-md-h5">
            <span
              style="font-weight: 100"
              v-html="
                services[currentId - 1].subtitle.slice(
                  0,
                  showText ? services[currentId - 1].subtitle.length : 350
                )
              "
            >
            </span>
            <span v-if="currentId != 9" style="font-weight: 100">{{
              showText ? "" : "..."
            }}</span>
          </div>
          <div class="d-flex flex-row">
            <v-spacer />
            <v-btn v-if="currentId != 9" outlined @click="showText = !showText">
              Подробнее</v-btn
            >
          </div>
        </v-container>
      </v-col>
    </v-row>
  </div>
</template>
<script>
export default {
  data() {
    return {
      showText: false,
      services: [
        {
          title: "Генеральный подрядчик",
          image: require("../assets/services/6.jpg"),
          subtitle:
            "<strong>Генеральный подрядчик</strong> – юридическое лицо, отвечающее по договору за исполнение полного комплекса работ по строительству объектов «под ключ», деятельность которого регламентирована Градостроительным кодексом РФ. <br/><strong>Генеральный подрядчик решает следующие задачи:    </strong><br/>- Предварительная оценка стоимости работ, составление бюджета строительства  <br/>- Разработка совмещенного и взаимоувязанного графика производства работ  <br/>- Организация отбора исполнителей на тендерной основе: поставщиков, субподрядчиков и прочих участников проекта, наиболее оптимальных с точки зрения качества, сроков и стоимости  <br/>- Контроль за качеством строительных работ, выполняемых подрядчиками, в том числе за соответствием строительных материалов и изделий техрегламентам, проектной и рабочей документации  <br/>- Организация и управление строительной площадкой, координация деятельности подрядных организаций  <br/>- Организация поставок, складирования и хранения оборудования и материалов  <br/>- Контроль за безопасностью строительных работ и труда на строительной площадке  <br/>- Предъявление объекта приемочной комиссии",
        },
        {
          title: "Строительно-монтажные работы",
          image: require("../assets/services/5.jpg"),
          subtitle:
            "<strong>ООО «ПСК КАРЬЕ» выполняет полный комплекс строительно-монтажных работ в Москве и других регионах РФ.</strong> <br/>Гарантируем грамотное,качественное и оперативное выполнение строительно-монтажных работ любой сложности :<br/><strong>- Подготовительные работы</strong> (обустройство строительной площадки и бытового городка, вывоз мусор);<br/><strong>- Строительно-монтажные работы:</strong><br/>общестроительные (демонтажные работы, земляные работы, свайные работы, закрепление грунтов, устройство бетонных и железобетонных монолитных конструкций, монтаж сборных бетонных и железобетонных конструкций, работы по устройству каменных конструкций, монтаж металлических конструкций, монтаж деревянных конструкций, защита строительных конструкций, трубопроводов и оборудования, устройство кровель, фасадные работы, опалубочные, арматурные работы, каркасно-обшивные перегородки, стены из панелей типа «Сэндвич», монтаж стен и конструкций из пеноблоков, кирпича, пазогребневых блоков, гипсокартона, стеклянных блоков, профильного стекла, устройство шумоизоляции стен, полов и потолков, штукатурные работы (стены, потолки, откосы), устройство выравнивающих стяжек перекрытий), черновая и чистовая отделка (монтаж подвесных потолков из ГКЛ, панелей, плит с лицевой отделкой, натяжных и реечных потолков, шпатлевка и окраска стен, потолков, проемов, ниш, устройство декоративных арок, проемов, ниш, установка оконных, дверных блоков, пространственных конструкций из алюминиевого профиля, профиля ПВХ, стеклопластика, иных полимерных и комбинированных материалов, облицовка стен и полов плиткой, поклейка обоев, нанесение декоративных покрытий, устройство полов из ламинированного паркета, паркетной доски, пробкового покрытия, устройство полов из массива и штучного паркета, настил напольных покрытий всех видов и типов) <br/><strong>- Устройство внутренних силовых инженерных систем и оборудования зданий и сооружений:</strong> ЭО (внутреннее электроосвещение), ЭОМ (сети электроснабжения), ЭМ (электрооборудование)) <br/><strong>- Устройство внутренних слаботочных систем и оборудования зданий и сооружений</strong> ( Система телефонной связи с применением автоматической телефонной станции (АТС), Локальная вычислительная сеть (ЛВС) ), Структурированная кабельная система (СКС), Система радиофикации (СРФ), Система коллективного приема телевидения (СКТ), Система интерактивного телевидения (СИТ), Система автоматической пожарной сигнализации (АПС), Система автоматизации противодымной защиты (АПЗ), Система оповещения и управления эвакуацией людей при пожаре (СОУЭ), Система охранной сигнализации (ОС), Система тревожной сигнализации (ТС), Система видеонаблюдения (СОТ), Система контроля и управления доступом (СКУД), Система электрочасофикации (ЭЧ) <br/><strong>- Устройство внутренних инженерных систем и оборудования зданий и сооружений:</strong> ОВ1 (отопление и теплоснабжение), ВК (водопровод и канализация), ХС (холодоснабжение), ОВ2 (вентиляция и кондиционирование), автоматизация ОВ2, АВПТ (сплинкерное пожаротушение), МГ (медицинское газоснабжение),  Система автоматизации автоматического (водяного, порошкового, газового) пожаротушения (АПТ) <br/><strong>- Монтажу Автоматизированная система управления и диспетчеризации инженерного оборудования здания (АСУЗ) </strong><br/><strong>- Строительство наружных инженерных сетей</strong> (наружных сетей водопровода, наружных сетей канализации, наружных сетей теплоснабжения, наружных сетей газоснабжения, электрических сетей), открытым способом так и с применением методов горизонтального направленное бурение (ГНБ).",
        },
        {
          title: "Проектирование в строительстве",
          image: require("../assets/services/8.jpg"),
          subtitle:
            "<strong>Авторский надзор в строительстве</strong> <br/>Авторский надзор в строительстве — это организация и проведение визуального наблюдения за проектом и подготовка специальной документации. Данная процедура позволяет следить за тем, чтобы процесс строительства отвечал установленным стандартам, которые четко прописаны в Гражданском Кодексе РФ. <br/><strong>Подготовка проектно-сметной документации</strong> <br/>Подготовка проектно-сметной документации — ответственный этап на пути к успешной реализации проекта. От качества проектной документации зависит скорость прохождения экспертизы и получения разрешения на строительство, а также это минимизирует риска ошибок и несогласованных действий участников строительного процесса. <br/><strong>Генеральный проектировщик</strong> <br/>Генеральный проектировщик — юридическое лицо, координирующее работы по проектированию, увязку архитектурных, конструктивных и объемно- планировочных решений и согласование документации. Он ведет объект от концепции до получения положительного заключения экспертизы, разрешения на строительство, авторского надзора и сдачи в эксплуатацию. <br/><strong>Аудит проектной документации</strong> <br/>Аудит проектной документации обеспечит достоверную и объективную информацию для Заказчика о качестве и полноте проектной документации, об имеющихся проблемах и рисках, а также о недостатках и нарушениях, которые были допущены в проектных решениях. <br/><strong>Исходно-разрешительная документация </strong><br/>Сбор и формирование комплекта исходно-разрешительной документации (ИРД) для проектирования, реконструкции и строительства является одним из главных этапов реализации проекта строительства. <br/><strong>Согласование проектной документации </strong><br/>Согласование проектной документации в органах контроля, надзора и эксплуатационными организациями — обязательное условие для получения разрешения на строительство. Это сложный процесс, который требует соблюдения законодательных норм, правил оформления проекта и требований к комплектности пакета документов, грамотности технических решений.",
        },
        {
          title: "Финансово-строительный аудит и мониторинг",
          image: require("../assets/services/4.jpg"),
          subtitle:
            "<strong>Финансово-строительный аудит</strong> — независимая оценка фактического состояния объекта строительства. Он дает объективную картину на дату проверки, помогает выявить потенциальные риски и эффективно управлять ими, скорректировать экономические показатели и минимизировать последствия. Строительный аудит проводится независимой экспертной компанией в целях получения достоверной информации и защищает интересы Заказчика, Кредитора или Инвестора. Он позволяет контролировать финансовые и технические аспекты реализации инвестиционно-строительного проекта, подтверждать достигнутые технико-экономические показатели. Строительный аудит может выполняться на всех этапах реализации инвестиционного проекта от старта до сдачи объекта в эксплуатацию.",
        },
        {
          title: "Технический заказчик",
          image: require("../assets/services/9.jpg"),
          subtitle:
            "<strong>Служба технического заказчика</strong> выполняет от имени Инвестора все правомерные действия, направленные на своевременное и надлежащее производство работ по проектированию и строительству объекта недвижимости. Технический заказчик – неотъемлемый участник инвестиционно-строительного проекта, который выполняет полный комплекс инжиниринговых услуг в строительстве от разработки проекта до сдачи объекта в эксплуатацию. Функции технического заказчика зависят от специфики объекта и вида выполняемых работ по проектированию и инженерным изысканиям, возведению, реконструкции или капитальному ремонту зданий и сооружений. Наша компания берет на себя весь комплекс работ по оформлению исходно-разрешительной и градостроительной документации, разработке, согласованию и экспертизе проектно-сметной документации, организует весь процесс строительства объектов любого назначения во всех регионах РФ. <br/><strong>Услуги и функции технического заказчика на разных этапах инвестиционно-строительного проекта:</strong> <br/>- Создание модели управления инвестиционно-строительным проектом <br/>- Разработка технико-экономического обоснования инвестиций <br/>- Формирование пакета исходно-разрешительной документации <br/>- Организация и управление разработкой проектной документации на различных стадиях реализации проекта <br/>- Контроль получения положительного заключения государственной экспертизы <br/>- Организация и проведение совместно с Заказчиком выбора на конкурсной основе Генерального проектировщика, Генподрядчика и других участников проекта <br/>- Сопровождение проекта - Получение разрешения на строительство <br/>- Контроль за организацией строительства объекта Генеральным подрядчиком <br/>- Строительный контроль <br/>- Контроль ведения исполнительной документации <br/>- Контроль целевого использования денежных средств <br/>- Взаимодействие с контролирующими государственными организациями <br/>- Получение разрешения на ввод объекта в эксплуатацию",
        },
        {
          title: "Консалтинг",
          image: require("../assets/services/7.jpg"),
          subtitle:
            "<strong>Сопровождение строительства</strong> – работа сотрудников компании по минимизации рисков в договорных отношениях между участниками инвестиционно- строительной деятельности. Наши специалисты готовы оказать квалифицированную помощь, основанную на глубоком понимании гражданско-правовых отношений в строительстве и многолетнем практическом опыте в данной сфере. Документальное сопровождение строительства – профессиональное сопровождение инвестиционно-строительного проекта на всех этапах реализации. Вы получите документацию, успешно прошедшую необходимые согласования, и существенно сократите сроки реализации строительного проекта. Благодаря многолетнему опыту управления инвестиционно-строительными проектами объектов различного назначения специалисты компании сформировали комплекс консультационных услуг. Это могут быть единовременные и периодические консультации по различным вопросам на любых этапах реализации проекта.",
        },
        {
          title: "Чистые помещения",
          image: require("../assets/services/1.jpg"),
          subtitle:
            "<strong>ООО «ПСК КАРЬЕ»</strong> оказывает комплекс сопутствующих услуг для организации чистых комнат «под ключ»: <br/>- Проектирование объекта по техническому заданию заказчика с учетом требований отраслевых стандартов. Мы создадим систему, полностью отвечающую технологическим особенностям производства. <br/>- Поставка ограждающих конструкций, оборудования, дополнительных элементов в оптимальные сроки. Обеспечим строгий контроль качества материалов. <br/>- Строительство чистых помещений, монтаж внутреннего оснащения. Наши специалисты обладают большим профессиональным опытом, знают все особенности отделочных материалов и комплектующих. Сборка осуществляется по техническим рекомендациям производителя.",
        },
        {
          title: "Пусконаладочные работы (ПНР)",
          image: require("../assets/services/3.jpg"),
          subtitle:
            "<strong>Пусконаладочные работы</strong> — совокупность операций и действий, позволяющих начать эксплуатировать объект. Они предусмотрены для проверки согласованности деятельности всех инженерных систем после прекращения строительно-монтажных работ. Задача ПНР — многогранный контроль точности выполненных установочных работ, поиск дефектов электрических устройств, полученных во время производства, настройка работы техники с учетом критических нагрузок, преобразование технических характеристик электрического оборудования на проектные потребительские значения. При обнаружении недочетов в монтаже, который осуществил строительно-монтажный отдел, сотрудники нашей организации определят оптимальное оборудование, откорректируют в случае потребности режимные настройки. Проверка состояния оборудования, его наладка позволяют обеспечить заказчику надежную и стабильную будущую работу техники.",
        },
        {
          title: "Дизайн интерьеров",
          image: require("../assets/services/2.jpg"),
          subtitle:
            "<strong>Комплексный подход к созданию интерьера: от идеи до воплощения.",
        },
      ],
    };
  },
  props: {
    service: {
      type: Object,
    },
  },
  computed: {
    currentHeight() {
      return window.innerHeight;
    },
    currentId() {
      return Number.parseInt(this.$route.params["id"]);
    },

    mobile() {
      switch (this.$vuetify.breakpoint.name) {
        case "xs":
          return { back: "white-back", marg: "margin:0" };
        case "sm":
          return { back: "white-back", marg: "margin:0" };

        default:
          if (this.currentHeight > 800) {
            return {
              back: "wrapper",
              center: "align-center",
            };
          } else {
            return {
              back: "wrapper",
              marg: "margin-top:80px !important",
              center: "align-center",
            };
          }
      }
    },
  },
};
</script>

<style>
.inforamtionContainer {
  margin-top: 100px;
}
</style>