<template>
  <v-col
    cols="12"
    md="6"
    lg="5"
    offset="0"
    :class="[mobile.back, showText ? 'inforamtionContainer' : '']"
    class="ml-md-6 pa-5 pa-md-10"
  >
    <v-container>
      <div class="text-h5 text-sm-h4 text-md-h3 orange-underline mb-10">
        <span class="ubuntu">{{ information[currentSlide].title }}</span>
      </div>
      <div :class="fontSize" class="text-md-h5">
        <span
          style="font-weight: 100"
          v-html="
            information[currentSlide].subtitle.slice(
              0,
              showText ? information[currentSlide].subtitle.length : 350
            )
          "
        ></span>
        <span style="font-weight: 100">{{ showText ? "" : "..." }}</span>
      </div>
      <div class="d-flex flex-row">
        <v-spacer />
        <v-btn v-show="slide != 5" outlined @click="showText = !showText">
          Подробнее</v-btn
        >
      </div>
    </v-container>
  </v-col>
</template>
<script>
export default {
  props: {
    slide: {
      type: Number,
    },
  },
  data() {
    return {
      showText: false,
      information: [
        // {
        //   title: "Полис",
        //   subtitle:
        //     "Страхование гражданской ответственности при проведении работ для строителей / проектировщиков / изыскателей охватывает риски, связанные с возникновением обязанности Страхователя (лиц, чья ответственность застрахована) возместить ущерб, возникший вследствие причинения вреда жизни, здоровью и/или имуществу третьих лиц в период проведения строительно-монтажных работ.",
        // },
        {
          title: "Система менеджмента качества",
          subtitle:
            "Проведение изыскательских работ, проектирование и строительно-монтажные работы - это сложный многогранный процесс, в котором участвует весь без исключения персонал компании. Для того, чтобы обеспечить эффективное сотрудничество всех структур компании для повышения качества оказываемых услуг, в ООО “ПСК КАРЬЕ” внедрена и успешно функционирует Система менеджмента качества, сертифицированная по ИСО 9001-2015. Процесс изысканий, проектирования и строительно-монтажных работ представляет собой иерархическую многоуровневую и взаимодействующую структуру со множеством параллельных и подчиненных друг другу подсистем и элементов (отделов). Каждая подсистема выполняет свою функцию, внося &quot;вклад&quot; в достижение общей цели - повышение конкурентности производимых работ и услуг. Чтобы организовать слаженную работу всех структур, была специально разработана и внедрена Система качества СМК, учитывающая особенности именно нашей деятельности. Для каждой структурной единицы (отдела) были разработаны: - политика в области качества, то есть поставлены цели и задачи; - способы, методы и принципы достижения поставленных задач; - критерии оценки эффективности работы. Для соблюдения всех программ управления качеством применяются системный и процессный подходы, которые рассматривают деятельность предприятия как совокупность всех задействованных структур и их распределение и сотрудничество как по горизонтали, так и по вертикали: отдел снабжения; проектно-изыскательский отдел; строительный участок; отдел технического контроля и контроля качества; монтажный отдел; отдел логистики; отдел кадров; финансовый отдел; коммерческий отдел и др. Гарантом соблюдения внедренной системы менеджмента качества в организации выступает Генеральный директор. Эффективной работой каждого отдела руководят начальники соответствующих отделов, которые планируют, организуют, мотивируют и контролируют работу всех сотрудников в соответствии с разработанной Системой. Применяя и следуя имеющейся Системе управления качеством оказываемых услуг, ООО ПСК КАРЬЕ должно достигнуть следующих целей: финансовую устойчивость и стабильность; роста объема услуг и работ за счет оптимизации всех процессов; расширения ассортимента оказываемых работ и услуг; снижения себестоимости производимых работ и услуг; улучшения качества проектных и строительно-монтажных работ.",
        },
        {
          title: "СРО",
          subtitle:
            "<strong>ООО ПСК КАРЬЕ является членом:</strong> <br/> - Союза «Строители Московской области «Мособлстройкомплекс» (Союз «Мособлстройкомплекс») СРО, основанное на членстве лиц, осуществляющих строительство (Регистрационный номер в государственном реестре саморегулируемых организаций СРО-С-035- 09092009) <br/> - Ассоциации организаций в области архитектурно-строительного проектирования «Мастер- Проект» (Ассоциация «Мастер-Проект») СРО, основанное на членстве лиц, осуществляющих подготовку проектной документации (Регистрационный номер в государственном реестре саморегулируемых организаций СРО-П-202-09082018)",
        },
      ],
    };
  },
  computed: {
    mobile() {
      switch (this.$vuetify.breakpoint.name) {
        case "xs":
          return { back: "white-back" };
        case "sm":
          return { back: "white-back" };

        default:
          return {
            back: "wrapper",
          };
      }
    },
    currentSlide() {
      switch (this.slide) {
        case 0:
          return 0;
        case 1:
          return 1;
        default:
          return 2;
      }
    },
    fontSize() {
      switch (this.$vuetify.breakpoint.name) {
        case "xs":
          return "text-h6";
        default:
          return "text-h5";
      }
    },
  },
};
</script>